/*
	Кратко о работе с функциями:
	1) Значения в скобках - это аргументы, которые мы получаем в момент вызова функции. Их и надо присваивать требуемым в заданиях переменным.
	2) После ключевого слова return вместо комментария необходимо написать переменную либо выражение с ответом.
	3) console.log() прописывать не обязательно, т.к. команда return уже означает вывод результата работы функции.
 */

function averageMark(a, g, p) {
	
    let s = (a + g + p)/3;
    let n = 3;
     //Здесь n - округляем до n знаков после зяпятой
	  let m = Math.pow(10,n);
	  return Math.round(s*m)/m;
    
}

function sayHello(userName) {
	
	return "Привет, мир! Меня зовут " + userName;
}



function calculateFormula() {
    
	return x * y + 5 * z + x - 1;
   
}

let x = 2;
let y = 22;
let z = 0;